
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3122391471)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/1ae3904e-a1d6-461f-a427-8ef7e9275b45/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
aws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]
aws_ecs_cluster.memo_board: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
data.aws_iam_role.task_execution: Reading...
data.aws_iam_policy_document.memo_board_tf_exec: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ecs_task_definition.memo_board_rs: Reading...
data.aws_iam_policy_document.memo_board_tf1: Reading...
aws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]
aws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_caller_identity.current: Read complete after 0s [id=281036478087]
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
aws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]
data.aws_iam_role.task_execution: Read complete after 1s [id=ecsTaskExecutionRole]
data.aws_iam_policy_document.memo_board_tf: Reading...
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
data.aws_ecs_task_definition.memo_board_rs: Read complete after 1s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:2]
aws_ecs_cluster_capacity_providers.memo_board: Refreshing state... [id=memo_board]
aws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]
aws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
aws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]
aws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3]
aws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]
aws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]
aws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]
aws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]
aws_security_group.memo_board_rs: Refreshing state... [id=sg-033af2ba0540ee42c]
aws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]
aws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]
aws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]
aws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]
aws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]
aws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]
aws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/f1b6bdac97f2109a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.memo_board_rs will be created
  + resource "aws_ecs_service" "memo_board_rs" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board"
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "memo_board_rs"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "memo_board_rs:2"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "memo_board_rs"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-033af2ba0540ee42c",
            ]
          + subnets          = [
              + "subnet-047a19359c4468354",
              + "subnet-0ae15c749b9813fb9",
              + "subnet-0f84ebfae4c920a30",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_ecs_service.memo_board_rs: Creating...
aws_ecs_service.memo_board_rs: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:281036478087:service/memo_board/memo_board_rs]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Aaws_ecs_cluster.memo_board: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_role.task_execution: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_ecs_task_definition.memo_board_rs: Reading...%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_role.task_execution: Read complete after 1s [id=ecsTaskExecutionRole]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_ecs_task_definition.memo_board_rs: Read complete after 1s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:2]%0Aaws_ecs_cluster_capacity_providers.memo_board: Refreshing state... [id=memo_board]%0Aaws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3]%0Aaws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_security_group.memo_board_rs: Refreshing state... [id=sg-033af2ba0540ee42c]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0Aaws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/f1b6bdac97f2109a]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.memo_board_rs will be created%0A  + resource "aws_ecs_service" "memo_board_rs" {%0A      + cluster                            = "arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board"%0A      + deployment_maximum_percent         = 100%0A      + deployment_minimum_healthy_percent = 0%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "memo_board_rs"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = "memo_board_rs:2"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "memo_board_rs"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = [%0A              + "sg-033af2ba0540ee42c",%0A            ]%0A          + subnets          = [%0A              + "subnet-047a19359c4468354",%0A              + "subnet-0ae15c749b9813fb9",%0A              + "subnet-0f84ebfae4c920a30",%0A            ]%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Aaws_ecs_service.memo_board_rs: Creating...%0Aaws_ecs_service.memo_board_rs: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:281036478087:service/memo_board/memo_board_rs]%0A%0AApply complete! Resources: 1 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Aaws_ecs_cluster.memo_board: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_role.task_execution: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_ecs_task_definition.memo_board_rs: Reading...%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_role.task_execution: Read complete after 1s [id=ecsTaskExecutionRole]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_ecs_task_definition.memo_board_rs: Read complete after 1s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:2]%0Aaws_ecs_cluster_capacity_providers.memo_board: Refreshing state... [id=memo_board]%0Aaws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3]%0Aaws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_security_group.memo_board_rs: Refreshing state... [id=sg-033af2ba0540ee42c]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0Aaws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/f1b6bdac97f2109a]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.memo_board_rs will be created%0A  + resource "aws_ecs_service" "memo_board_rs" {%0A      + cluster                            = "arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board"%0A      + deployment_maximum_percent         = 100%0A      + deployment_minimum_healthy_percent = 0%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "memo_board_rs"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = "memo_board_rs:2"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "memo_board_rs"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = [%0A              + "sg-033af2ba0540ee42c",%0A            ]%0A          + subnets          = [%0A              + "subnet-047a19359c4468354",%0A              + "subnet-0ae15c749b9813fb9",%0A              + "subnet-0f84ebfae4c920a30",%0A            ]%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Aaws_ecs_service.memo_board_rs: Creating...%0Aaws_ecs_service.memo_board_rs: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:281036478087:service/memo_board/memo_board_rs]%0A%0AApply complete! Resources: 1 added, 0 changed, 0 destroyed.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":24,"Program":"tfcmt","SHA1":"2a93420027de6df41a89a31437de8634c5882ab1","Vars":{},"WorkflowName":"Terraform"} -->